// Задача 19
// Напишите программу, которая принимает на вход пятизначное число
//  и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

// System.Console.WriteLine("Enter number : ");
// string number = Console.ReadLine();
// if (number is not null)
// {
//     if (number.Length == 5)
//     {
//         if ((number[0] == number[4]) && (number[1] == number[3]))
//         {
//             Console.WriteLine("Число является палиндромом");
//         }
//         else
//         {
//             Console.WriteLine("Число не является палиндром");
//         }
//     }
//     else
//     {
//         Console.WriteLine("Введено не 5-значное число");
//     }
// }
